[
  {
    "key": 1,
    "title": "Web  Designing",
    "duration": "7 months ",
    "fee": "$100",
    "details": "Web design encompasses many different skills and disciplines in the production and maintenance of websites. The different areas of web design include web graphic design; user interface design (UI design); authoring, including standardized code and proprietary software; user experience design (UX design); and search engine optimization. Often many individuals will work in teams covering different aspects of the design process, although some designers will cover them all. The term \"web design\" is normally used to describe the design process relating to the front-end (client side) design of a website including writing markup. Web design partially overlaps web engineering in the broader scope of web development. Web designers are expected to have an awareness of usability and if their role involves creating markup then they are also expected to be up to date with web accessibility guidelines.",
    "lastDate": "29- Nov-2021 ",
    "classCount": "1000+",
    "link": "https://en.wikipedia.org/wiki/Web_design",
    "requirementS": "Figma ,Adobe xd , Sketch ,Farmer , Adobe Photoshop",
    "trainer": "Tirtha Paul",
    "enroll": "1000+",
    "rating": 4.4,
    "img": "https://cholojani.com/wp-content/uploads/2021/06/webdesign-coimbatore.jpg"
  },
  {
    "key": 2,
    "title": "Web  Development",
    "duration": " 9 months ",
    "fee": "$200",
    "details": "Web development is the work involved in developing a Web site for the Internet (World Wide Web) or an intranet (a private network). Web development can range from developing a simple single static page of plain text to complex web applications, electronic businesses, and social network services. A more comprehensive list of tasks to which Web development commonly refers, may include Web engineering, Web design, Web content development, client liaison, client-side/server-side scripting, Web server and network security configuration, and e-commerce development.\n\n        Among Web professionals, \"Web development\" usually refers to the main non-design aspects of building Web sites: writing markup and coding. Web development may use content management systems (CMS) to make content changes easier and available with basic technical skills.\n        \n        For larger organizations and businesses, Web development teams can consist of hundreds of people (Web developers) and follow standard methods like Agile methodologies while developing Web sites. Smaller organizations may only require a single permanent or contracting developer, or secondary assignment to related job positions such as a graphic designer or information systems technician. Web development may be a collaborative effort between departments rather than the domain of a designated department. There are three kinds of Web developer specialization: front-end developer, back-end developer, and full-stack developer. Front-end developers are responsible for behavior and visuals that run in the user browser, while back-end developers deal with the servers.",
    "lastDate": "10- Jan-2022 ",
    "classCount": "1000+",
    "link": "https://en.wikipedia.org/wiki/Web_development",
    "requirementS": "Vs Code , Node Js , Browser etc",
    "trainer": "Alex Blander",
    "enroll": "900+",
    "rating": 5,
    "img": "https://www.theblogy.com/wp-content/uploads/2020/06/web-devwlop.png"
  },
  {
    "key": 3,
    "title": "Video Editing",
    "duration": "3 Months",
    "fee": "$100",
    "details": "Video editing is the manipulation and arrangement of video shots. Video editing is used to structure and present all video information, including films and television shows, video advertisements and video essays. Video editing has been dramatically democratized in recent years by editing software available for personal computers. Editing video can be difficult and tedious, so several technologies have been produced to aid people in this task. Pen based video editing software was developed in order to give people a more intuitive and fast way to edit video",
    "lastDate": "31- Dec-2021 ",
    "classCount": "250+",
    "link": "https://en.wikipedia.org/wiki/Video_editing",
    "requirementS": "Adobe Primer Pro , Adobe After Effect , Adobe Media Encoder",
    "trainer": "Ridby Rabbi",
    "enroll": "1500+",
    "rating": 4.7,
    "img": "https://www.mycplus.com/mycplus/wp-content/uploads/2020/10/best-video-editing-tools.png"
  },
  {
    "key": 4,
    "title": "Photography",
    "duration": "3.5 Months",
    "fee": "$80",
    "details": "Photography is the art, application, and practice of creating durable images by recording light, either electronically by means of an image sensor, or chemically by means of a light-sensitive material such as photographic film. It is employed in many fields of science, manufacturing (e.g., photolithography), and business, as well as its more direct uses for art, film and video production, recreational purposes, hobby, and mass communication.\n        \n        Typically, a lens is used to focus the light reflected or emitted from objects into a real image on the light-sensitive surface inside a camera during a timed exposure. With an electronic image sensor, this produces an electrical charge at each pixel, which is electronically processed and stored in a digital image file for subsequent display or processing. The result with photographic emulsion is an invisible latent image, which is later chemically \"developed\" into a visible image, either negative or positive depending on the purpose of the photographic material and the method of processing. A negative image on film is traditionally used to photographically create a positive image on a paper base, known as a print, either by using an enlarger or by contact printing.",
    "lastDate": "22- Dec-2021 ",
    "classCount": "150+",
    "link": "https://en.wikipedia.org/wiki/Video_editing",
    "requirementS": "Adobe Photoshop ,Adobe Lightroom ,Adobe Illustrator",
    "trainer": "Ariyan Islam",
    "enroll": "1500+",
    "rating": 4.3,
    "img": "https://images.squarespace-cdn.com/content/v1/5c90fe2eaf468307c83acde2/1582809468618-5SMX6M2YIOUZJVAN4IZ5/How+Digital+Technology+Has+Changed+Photography"
  },
  {
    "key": 5,
    "title": "3d Animation",
    "duration": "5 Months",
    "fee": "$480",
    "details": "Animation is a method in which figures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film. Today, most animations are made with computer-generated imagery (CGI). Computer animation can be very detailed 3D animation, while 2D computer animation (which may have the look of traditional animation) can be used for stylistic reasons, low bandwidth, or faster real-time renderings. Other common animation methods apply a stop motion technique to two and three-dimensional objects like paper cutouts, puppets, or clay figures.\n\n        Commonly, the effect of the animation is achieved by a rapid succession of sequential images that minimally differ from each other. The illusion—as in motion pictures in general—is thought to rely on the phi phenomenon and beta movement, but the exact causes are still uncertain. Analog mechanical animation media that rely on the rapid display of sequential images include the phénakisticope, zoetrope, flip book, praxinoscope, and film. Television and video are popular electronic animation media that originally were analog and now operate digitally. For display on the computer, techniques like animated GIF and Flash animation were developed.\n        \n        Animation is more pervasive than many people know. Apart from short films, feature films, television series, animated GIFs, and other media dedicated to the display of moving images, animation is also prevalent in video games, motion graphics, user interfaces, and visual effects\n        \n        The physical movement of image parts through simple mechanics—for instance moving images in magic lantern shows—can also be considered animation. The mechanical manipulation of three-dimensional puppets and objects to emulate living beings has a very long history in automata. Electronic automata were popularized by Disney as animation's.",
    "lastDate": "15- Dec-2021 ",
    "classCount": "500+",
    "link": "https://en.wikipedia.org/wiki/Animation#3D_animation",
    "requirementS": "Blender , Unity , Adobe Primer Pro , Adobe After Effect , Adobe Media Encoder",
    "trainer": "",
    "enroll": "600+",
    "rating": 5,
    "img": "https://i.all3dp.com/cdn-cgi/image/fit=cover,w=1284,h=722,gravity=0.5x0.5,format=auto/wp-content/uploads/2020/12/10183409/someone-designing-a-3d-model-digital-school-200710.jpg"
  },
  {
    "key": 6,
    "title": "Seo Marketing",
    "duration": "3 Months",
    "fee": "$120",
    "details": "Search engine optimization (SEO) is the process of improving the quality and quantity of website traffic to a website or a web page from search engines. SEO targets unpaid traffic (known as \"natural\" or \"organic\" results) rather than direct traffic or paid traffic. Unpaid traffic may originate from different kinds of searches, including image search, video search, academic search, news search, and industry-specific vertical search engines.\n\n        As an Internet marketing strategy, SEO considers how search engines work, the computer-programmed algorithms that dictate search engine behavior, what people search for, the actual search terms or keywords typed into search engines, and which search engines are preferred by their targeted audience. SEO is performed because a website will receive more visitors from a search engine when websites rank higher on the search engine results page (SERP). These visitors can then potentially be converted into customers. ",
    "lastDate": "15- Feb-2022 ",
    "classCount": "300+",
    "link": "https://en.wikipedia.org/wiki/Search_engine_optimization",
    "requirementS": "Entire In class",
    "trainer": "Sadman khan / Tahmid Araf",
    "enroll": "450+",
    "rating": 4.5,
    "img": "https://www.oberlo.com/media/1603954182-seo-article-header.png?fit=max&fm=jpg&w=1824"
  },
  {
    "key": 7,
    "title": "App Development",
    "duration": "1 year",
    "fee": "$250",
    "details": "Mobile app development is the act or process by which a mobile app is developed for mobile devices, such as personal digital assistants, enterprise digital assistants or mobile phones. These software applications are designed to run on mobile devices, such as a smartphone or tablet computer. These applications can be pre-installed on phones during manufacturing platforms, or delivered as web applications using server-side or client-side processing (e.g., JavaScript) to provide an \"application-like\" experience within a Web browser. Application software developers also must consider a long array of screen sizes, hardware specifications, and configurations because of intense competition in mobile software and changes within each of the platforms. Mobile app development has been steadily growing, in revenues and jobs created. A 2013 analyst report estimates there are 529,000 direct app economy jobs within the EU then 28 members (including the UK), 60 percent of which are mobile app developers.\n\n        As part of the development process, mobile user interface (UI) design is also essential in the creation of mobile apps. Mobile UI considers constraints, contexts, screen, input, and mobility as outlines for design. The user is often the focus of interaction with their device, and the interface entails components of both hardware and software. User input allows for the users to manipulate a system, and device's output allows the system to indicate the effects of the users' manipulation. Mobile UI design constraints include limited attention and form factors, such as a mobile device's screen size for a user's hand(s). Mobile UI contexts signal cues from user activity, such as location and scheduling that can be shown from user interactions within a mobile app. Overall, mobile UI design's goal is mainly for an understandable, user-friendly interface. The UI of mobile apps should: consider users' limited attention, minimize keystrokes, and be task-oriented with a minimum set of functions. This functionality is supported by mobile enterprise application platforms or integrated development environments (IDEs).\n        \n        Mobile UIs, or front-ends, rely on mobile back-ends to support access to enterprise systems. The mobile back-end facilitates data routing, security, authentication, authorization, working off-line, and service orchestration. This functionality is supported by a mix of middleware components including mobile app server, mobile backend as a service (MBaaS), and service-oriented architecture (SOA) infrastructure.",
    "classCount": "300+",
    "link": "https://en.wikipedia.org/wiki/Mobile_app_development",
    "requirementS": "Vs code , Android stdio etc",
    "trainer": "Iftekhar Islam",
    "enroll": "500+",
    "rating": 5,
    "img": "https://qph.fs.quoracdn.net/main-qimg-9ce8aa204a21e69716018fee472b042c"
  }
]
